#include <iostream>
using namespace std;

int main() {
    // Введення значень змінних
    double a, b, c, x;
    cout << "Введіть значення a: ";
    cin >> a;
    cout << "Введіть значення b: ";
    cin >> b;
    cout << "Введіть значення c: ";
    cin >> c;
    cout << "Введіть значення x: ";
    cin >> x;

    double F1, F2;

    // 1) Використання лише команд розгалуження в скороченій формі
    if (x < 5 && c != 0) {
        F1 = -a * x * x - b;
    }
    else if (x > 5 && c == 0) {
        F1 = (x - a) / x;
    }
    else {
        F1 = -x / c;
    }

    // Виведення результату першого способу
    cout << "F (скорочена форма) = " << F1 << endl;

    // 2) Використання лише команд розгалуження в повній формі
    if (x < 5) {
        if (c != 0) {
            F2 = -a * x * x - b;
        }
        else {
            F2 = -x / c;
        }
    }
    else if (x > 5) {
        if (c == 0) {
            F2 = (x - a) / x;
        }
        else {
            F2 = -x / c;
        }
    }
    else {
        F2 = -x / c;
    }

    // Виведення результату другого способу
    cout << "F (повна форма) = " << F2 << endl;

    // Перевірка, чи збігаються результати
    if (F1 == F2) {
        cout << "Результати збігаються." << endl;
    }
    else {
        cout << "Результати не збігаються." << endl;
    }

    return 0;
}
